In [1]:
import pandas as pd
import numpy as np
import matplotlib as mpl

import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv("Salaries.csv")

In [3]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [4]:
df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [9]:
df.sample()

    rank discipline  phd  service   sex  salary
25  Prof          B   35       31  Male   99418

In [10]:
df.sample(10)

         rank discipline  phd  service     sex  salary
11       Prof          B   23       23    Male  134778
2        Prof          A   23       20    Male  110515
23   AsstProf          A    2        0    Male   85000
60   AsstProf          B    3        3  Female   92000
26       Prof          A   38       19    Male  148750
75       Prof          B   17       17  Female  124312
54  AssocProf          A   25       22  Female   62884
67       Prof          A   17       11  Female   90450
28   AsstProf          B    7        2    Male   91300
27       Prof          A   45       43    Male  155865

In [11]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [13]:
df['salary'].dtype

dtype('int64')

In [15]:
df[['salary','service']].dtypes

salary     int64
service    int64
dtype: object

In [17]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [18]:
df.ndim

2

In [19]:
df.size

468

In [20]:
df.shape

(78, 6)

In [22]:
df.shape[0]

78

In [23]:
df.shape[1]

6

In [24]:
df.values

array([['Prof', 'B', 56, 49, 'Male', 186960],
       ['Prof', 'A', 12, 6, 'Male', 93000],
       ['Prof', 'A', 23, 20, 'Male', 110515],
       ['Prof', 'A', 40, 31, 'Male', 131205],
       ['Prof', 'B', 20, 18, 'Male', 104800],
       ['Prof', 'A', 20, 20, 'Male', 122400],
       ['AssocProf', 'A', 20, 17, 'Male', 81285],
       ['Prof', 'A', 18, 18, 'Male', 126300],
       ['Prof', 'A', 29, 19, 'Male', 94350],
       ['Prof', 'A', 51, 51, 'Male', 57800],
       ['Prof', 'B', 39, 33, 'Male', 128250],
       ['Prof', 'B', 23, 23, 'Male', 134778],
       ['AsstProf', 'B', 1, 0, 'Male', 88000],
       ['Prof', 'B', 35, 33, 'Male', 162200],
       ['Prof', 'B', 25, 19, 'Male', 153750],
       ['Prof', 'B', 17, 3, 'Male', 150480],
       ['AsstProf', 'B', 8, 3, 'Male', 75044],
       ['AsstProf', 'B', 4, 0, 'Male', 92000],
       ['Prof', 'A', 19, 7, 'Male', 107300],
       ['Prof', 'A', 29, 27, 'Male', 150500],
       ['AsstProf', 'B', 4, 4, 'Male', 92000],
       ['Prof', 'A', 33, 30, 'Male', 103106],
       ['AsstProf', 'A', 4, 2, 'Male', 73000],
       ['AsstProf', 'A', 2, 0, 'Male', 85000],
       ['Prof', 'A', 30, 23, 'Male', 91100],
       ['Prof', 'B', 35, 31, 'Male', 99418],
       ['Prof', 'A', 38, 19, 'Male', 148750],
       ['Prof', 'A', 45, 43, 'Male', 155865],
       ['AsstProf', 'B', 7, 2, 'Male', 91300],
       ['Prof', 'B', 21, 20, 'Male', 123683],
       ['AssocProf', 'B', 9, 7, 'Male', 107008],
       ['Prof', 'B', 22, 21, 'Male', 155750],
       ['Prof', 'A', 27, 19, 'Male', 103275],
       ['Prof', 'B', 18, 18, 'Male', 120000],
       ['AssocProf', 'B', 12, 8, 'Male', 119800],
       ['Prof', 'B', 28, 23, 'Male', 126933],
       ['Prof', 'B', 45, 45, 'Male', 146856],
       ['Prof', 'A', 20, 8, 'Male', 102000],
       ['AsstProf', 'B', 4, 3, 'Male', 91000],
       ['Prof', 'B', 18, 18, 'Female', 129000],
       ['Prof', 'A', 39, 36, 'Female', 137000],
       ['AssocProf', 'A', 13, 8, 'Female', 74830],
       ['AsstProf', 'B', 4, 2, 'Female', 80225],
       ['AsstProf', 'B', 5, 0, 'Female', 77000],
       ['Prof', 'B', 23, 19, 'Female', 151768],
       ['Prof', 'B', 25, 25, 'Female', 140096],
       ['AsstProf', 'B', 11, 3, 'Female', 74692],
       ['AssocProf', 'B', 11, 11, 'Female', 103613],
       ['Prof', 'B', 17, 17, 'Female', 111512],
       ['Prof', 'B', 17, 18, 'Female', 122960],
       ['AsstProf', 'B', 10, 5, 'Female', 97032],
       ['Prof', 'B', 20, 14, 'Female', 127512],
       ['Prof', 'A', 12, 0, 'Female', 105000],
       ['AsstProf', 'A', 5, 3, 'Female', 73500],
       ['AssocProf', 'A', 25, 22, 'Female', 62884],
       ['AsstProf', 'A', 2, 0, 'Female', 72500],
       ['AssocProf', 'A', 10, 8, 'Female', 77500],
       ['AsstProf', 'A', 3, 1, 'Female', 72500],
       ['Prof', 'B', 36, 26, 'Female', 144651],
       ['AssocProf', 'B', 12, 10, 'Female', 103994],
       ['AsstProf', 'B', 3, 3, 'Female', 92000],
       ['AssocProf', 'B', 13, 10, 'Female', 103750],
       ['AssocProf', 'B', 14, 7, 'Female', 109650],
       ['Prof', 'A', 29, 27, 'Female', 91000],
       ['AssocProf', 'A', 26, 24, 'Female', 73300],
       ['Prof', 'A', 36, 19, 'Female', 117555],
       ['AsstProf', 'A', 7, 6, 'Female', 63100],
       ['Prof', 'A', 17, 11, 'Female', 90450],
       ['AsstProf', 'A', 4, 2, 'Female', 77500],
       ['Prof', 'A', 28, 7, 'Female', 116450],
       ['AsstProf', 'A', 8, 3, 'Female', 78500],
       ['AssocProf', 'B', 12, 9, 'Female', 71065],
       ['Prof', 'B', 24, 15, 'Female', 161101],
       ['Prof', 'B', 18, 10, 'Female', 105450],
       ['AssocProf', 'B', 19, 6, 'Female', 104542],
       ['Prof', 'B', 17, 17, 'Female', 124312],
       ['Prof', 'A', 28, 14, 'Female', 109954],
       ['Prof', 'A', 23, 15, 'Female', 109646]], dtype=object)

In [25]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [27]:
df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [28]:
df.sample()

         rank discipline  phd  service     sex  salary
74  AssocProf          B   19        6  Female  104542

In [29]:
df.sample(5)

         rank discipline  phd  service   sex  salary
25       Prof          B   35       31  Male   99418
8        Prof          A   29       19  Male   94350
34  AssocProf          B   12        8  Male  119800
28   AsstProf          B    7        2  Male   91300
6   AssocProf          A   20       17  Male   81285

In [30]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [31]:
df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [32]:
df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [33]:
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [34]:
df.median()

phd            18.5
service        14.5
salary     104671.0
dtype: float64

In [39]:
df.dropna()

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [41]:
df.isnull()

     rank  discipline    phd  service    sex  salary
0   False       False  False    False  False   False
1   False       False  False    False  False   False
2   False       False  False    False  False   False
3   False       False  False    False  False   False
4   False       False  False    False  False   False
..    ...         ...    ...      ...    ...     ...
73  False       False  False    False  False   False
74  False       False  False    False  False   False
75  False       False  False    False  False   False
76  False       False  False    False  False   False
77  False       False  False    False  False   False

[78 rows x 6 columns]

In [42]:
df.isnull().sum()

rank          0
discipline    0
phd           0
service       0
sex           0
salary        0
dtype: int64

In [43]:
df.isnull().any()

rank          False
discipline    False
phd           False
service       False
sex           False
salary        False
dtype: bool

In [44]:
df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [45]:
df['phd'].count()

78

In [51]:
df['phd'].value_counts()

4     6
17    5
20    5
12    5
23    4
18    4
29    3
25    3
28    3
3     2
5     2
11    2
7     2
45    2
10    2
2     2
13    2
19    2
8     2
35    2
36    2
39    2
14    1
26    1
56    1
30    1
27    1
22    1
9     1
21    1
38    1
33    1
1     1
51    1
40    1
24    1
Name: phd, dtype: int64

In [56]:
df['sex'].value_counts()

Male      39
Female    39
Name: sex, dtype: int64

In [57]:
df[['rank','discipline','sex']].value_counts()

rank       discipline  sex
Prof       A           Male      15
           B           Male      13
                       Female    10
           A           Female     8
AssocProf  B           Female     6
AsstProf   A           Female     6
           B           Male       6
                       Female     5
AssocProf  A           Female     4
           B           Male       2
AsstProf   A           Male       2
AssocProf  A           Male       1
dtype: int64

In [58]:
df.iloc[[0]]

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960

In [59]:
df.iloc[:,-3:]

    service     sex  salary
0        49    Male  186960
1         6    Male   93000
2        20    Male  110515
3        31    Male  131205
4        18    Male  104800
..      ...     ...     ...
73       10  Female  105450
74        6  Female  104542
75       17  Female  124312
76       14  Female  109954
77       15  Female  109646

[78 rows x 3 columns]

In [60]:
df.iloc[-3:]

    rank discipline  phd  service     sex  salary
75  Prof          B   17       17  Female  124312
76  Prof          A   28       14  Female  109954
77  Prof          A   23       15  Female  109646

In [61]:
df.iloc[1,3]

6

In [62]:
df.iloc[[1,5],[1,3]]

  discipline  service
1          A        6
5          A       20

In [63]:
df.iloc[:,[3]]

    service
0        49
1         6
2        20
3        31
4        18
..      ...
73       10
74        6
75       17
76       14
77       15

[78 rows x 1 columns]

In [67]:
df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [68]:
df['discipline'].unique()

array(['B', 'A'], dtype=object)

In [72]:
df_rank=df.groupby(['rank'])

In [73]:
df_rank

In [74]:
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [83]:
df.groupby(['discipline']).mean()

                  phd    service         salary
discipline
A           21.527778  15.722222   98331.111111
B           18.142857  14.476190  116331.785714

In [84]:
df.groupby('rank')['salary'].mean()

rank
AssocProf     91786.230769
AsstProf      81362.789474
Prof         123624.804348
Name: salary, dtype: float64

In [85]:
df.groupby(['sex'])['salary'].mean()

sex
Female    101002.410256
Male      115045.153846
Name: salary, dtype: float64

In [92]:
df.groupby(['rank','sex'])[['salary','phd']].mean()

                         salary        phd
rank      sex
AssocProf Female   88512.800000  15.500000
          Male    102697.666667  13.666667
AsstProf  Female   78049.909091   5.636364
          Male     85918.000000   4.250000
Prof      Female  121967.611111  23.722222
          Male    124690.142857  29.214286

In [103]:
df = pd.read_csv('Salaries.csv')

In [105]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [106]:
df[df['salary'] > 120000]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
3   Prof          A   40       31    Male  131205
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
10  Prof          B   39       33    Male  128250
11  Prof          B   23       23    Male  134778
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
29  Prof          B   21       20    Male  123683
31  Prof          B   22       21    Male  155750
35  Prof          B   28       23    Male  126933
36  Prof          B   45       45    Male  146856
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
58  Prof          B   36       26  Female  144651
72  Prof          B   24       15  Female  161101
75  Prof          B   17       17  Female  124312

In [107]:
df[df['rank'] == 'AssocProf' ]

         rank discipline  phd  service     sex  salary
6   AssocProf          A   20       17    Male   81285
30  AssocProf          B    9        7    Male  107008
34  AssocProf          B   12        8    Male  119800
41  AssocProf          A   13        8  Female   74830
47  AssocProf          B   11       11  Female  103613
54  AssocProf          A   25       22  Female   62884
56  AssocProf          A   10        8  Female   77500
59  AssocProf          B   12       10  Female  103994
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
64  AssocProf          A   26       24  Female   73300
71  AssocProf          B   12        9  Female   71065
74  AssocProf          B   19        6  Female  104542

In [110]:
df[(df['rank'] == 'AssocProf') & (df['discipline'] == 'A')]

         rank discipline  phd  service     sex  salary
6   AssocProf          A   20       17    Male   81285
41  AssocProf          A   13        8  Female   74830
54  AssocProf          A   25       22  Female   62884
56  AssocProf          A   10        8  Female   77500
64  AssocProf          A   26       24  Female   73300

In [112]:
print('The maximum salary of Assistant Professor is Rs. ',df[df['rank'] == 'AsstProf']['salary'].max())

The maximum salary of Assistant Professor is Rs.  97032

In [113]:
print('The average salary of female Assistant Professor is ',df[(df['rank'] == 'AsstProf') & (df['sex'] == 'Female')]['salary'].mean())

The average salary of female Assistant Professor is  78049.90909090909

In [116]:
print('The maximum service period for male professor is ',df[(df['rank'] == 'Prof') & (df['sex'] == 'Male')]['service'].max())

The maximum service period for male professor is  51

In [117]:
df[(df['rank'] == 'AssocProf') & (df['sex'] == 'Female')]['salary'].mean()

88512.8

In [118]:
df[(df['sex']=='Male') & (df['rank']=='Prof') & (df['discipline'] == 'A')]['salary'].min()

57800

In [73]:
len(df.groupby((df['sex'] == 'Female') & (df['rank'] == 'Prof') & (df['discipline'] == 'B')))

2

In [74]:
df.groupby((df['sex'] == 'Female') & (df['rank'] == 'Prof') & (df['discipline'] == 'B')).count()

       rank  discipline  phd  service  sex  salary
False    68          68   68       68   68      68
True     10          10   10       10   10      10

In [23]:
df.iloc[[2,4]]

   rank discipline  phd  service   sex  salary
2  Prof          A   23       20  Male  110515
4  Prof          B   20       18  Male  104800

In [25]:
df.iloc[:,[4]]

       sex
0     Male
1     Male
2     Male
3     Male
4     Male
..     ...
73  Female
74  Female
75  Female
76  Female
77  Female

[78 rows x 1 columns]

In [27]:
df.iloc[-2:]

    rank discipline  phd  service     sex  salary
76  Prof          A   28       14  Female  109954
77  Prof          A   23       15  Female  109646

In [30]:
#Q.write last 3 rows and last 2 columns
df.iloc[-3:,-2:]

       sex  salary
75  Female  124312
76  Female  109954
77  Female  109646

In [31]:
df.head(3)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515

In [38]:
#Q.write first 3 rows and 2nd & 4th columns
df.iloc[:3,[1,3]]

  discipline  service
0          B       49
1          A        6
2          A       20

In [43]:
#Q.Write 2nd row to 8th row
df.iloc[1:8]

        rank discipline  phd  service   sex  salary
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300

In [44]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

### Aggregation

In [51]:
df[['phd','salary']].agg(['min','mean','max'])

            phd         salary
min    1.000000   57800.000000
mean  19.705128  108023.782051
max   56.000000  186960.000000

In [48]:
df.groupby(['rank'])['phd','salary','service'].agg(['min','max','mean'])

          phd                salary                        service      \
          min max       mean    min     max           mean     min max
rank
AssocProf   9  26  15.076923  62884  119800   91786.230769       6  24
AsstProf    1  11   5.052632  63100   97032   81362.789474       0   6
Prof       12  56  27.065217  57800  186960  123624.804348       0  51


                mean
rank
AssocProf  11.307692
AsstProf    2.210526
Prof       21.413043

In [52]:
df['salary'].agg(['mean','std'])

mean    108023.782051
std      28293.661022
Name: salary, dtype: float64

In [53]:
df[['service','phd']].agg(['min','max'])

     service  phd
min        0    1
max       51   56

In [57]:
#Q.Calculate avg and max salary for male professors
df[(df['sex']=='Male') & (df['rank'] == 'Prof')]['salary'].agg(['mean','std'])

mean    124690.142857
std      27997.465651
Name: salary, dtype: float64

In [67]:
d = df[(df['sex']=='Male') & (df['rank'] == 'Prof')]

In [68]:
d['salary'].agg(['mean','std'])

mean    124690.142857
std      27997.465651
Name: salary, dtype: float64

In [63]:
df['salary'].mean()

108023.78205128205

In [65]:
df[(df['sex']=='Female') & (df['rank'] == 'Prof')]['salary'].agg(['min','max'])

min     90450
max    161101
Name: salary, dtype: int64

In [75]:
#Q.Calculate minimum and maximum, salary and service period for female professors
df[(df['sex'] == 'Female') & (df['rank'] == 'Prof')][['salary','service']].agg(['min','max'])

     salary  service
min   90450        0
max  161101       36